Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG00100.svd
               <register>
                  <name>LENGTH</name>
                  <description>USART Length</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LEN</name>
                        <description>Data Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>LENEN</name>
                        <description>Data Length Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LENENSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Length counter is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TX</name>
                              <description>Length counter is enabled for transmit</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RX</name>
                              <description>Length counter is enabled for receive</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>USART Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>USART Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOSPACE</name>
                  <description>USART FIFO Space</description>
                  <addressOffset>0x34</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TXSPACE</name>
                        <description>Tx FIFO Empty Space</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>RXSPACE</name>
                        <description>Rx FIFO Filled Space</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOPTR</name>
                  <description>USART FIFO CPU Pointers</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>CPUWRPTR</name>
                        <description>CPU FIFO Write Pointer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPURDPTR</name>
                        <description>CPU FIFO Read Pointer</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x44812000</baseAddress>
         <interrupt>
            <name>SERCOM1_56</name>
            <description>Serial Communication Interface 1</description>
            <value>50</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_0</name>
            <description>Serial Communication Interface 1</description>
            <value>51</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_1</name>
            <description>Serial Communication Interface 1</description>
            <value>52</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_2</name>
            <description>Serial Communication Interface 1</description>
            <value>53</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_3</name>
            <description>Serial Communication Interface 1</description>
            <value>54</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_4</name>
            <description>Serial Communication Interface 1</description>
            <value>55</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM2</name>
         <baseAddress>0x44814000</baseAddress>
         <interrupt>
            <name>SERCOM2_56</name>
            <description>Serial Communication Interface 2</description>
            <value>56</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_0</name>
            <description>Serial Communication Interface 2</description>
            <value>57</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_1</name>
            <description>Serial Communication Interface 2</description>
            <value>58</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_2</name>
            <description>Serial Communication Interface 2</description>
            <value>59</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_3</name>
            <description>Serial Communication Interface 2</description>
            <value>60</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_4</name>
            <description>Serial Communication Interface 2</description>
            <value>61</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM3</name>
         <baseAddress>0x44816000</baseAddress>
         <interrupt>
            <name>SERCOM3_56</name>
            <description>Serial Communication Interface 3</description>
            <value>62</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_0</name>
            <description>Serial Communication Interface 3</description>
            <value>63</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_1</name>
            <description>Serial Communication Interface 3</description>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_2</name>
            <description>Serial Communication Interface 3</description>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_3</name>
            <description>Serial Communication Interface 3</description>
            <value>66</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_4</name>
            <description>Serial Communication Interface 3</description>
            <value>67</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM4</name>
         <baseAddress>0x45000000</baseAddress>
         <interrupt>
            <name>SERCOM4_56</name>
            <description>Serial Communication Interface 4</description>
            <value>96</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_0</name>
            <description>Serial Communication Interface 4</description>
            <value>97</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_1</name>
            <description>Serial Communication Interface 4</description>
            <value>98</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_2</name>
            <description>Serial Communication Interface 4</description>
            <value>99</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_3</name>
            <description>Serial Communication Interface 4</description>
            <value>100</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_4</name>
            <description>Serial Communication Interface 4</description>
            <value>101</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM5</name>
         <baseAddress>0x45002000</baseAddress>
         <interrupt>
            <name>SERCOM5_56</name>
            <description>Serial Communication Interface 5</description>
            <value>102</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_0</name>
            <description>Serial Communication Interface 5</description>
            <value>103</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_1</name>
            <description>Serial Communication Interface 5</description>
            <value>104</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_2</name>
            <description>Serial Communication Interface 5</description>
            <value>105</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_3</name>
            <description>Serial Communication Interface 5</description>
            <value>106</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_4</name>
            <description>Serial Communication Interface 5</description>
            <value>107</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SPI_IXS</name>
         <version>035741a0</version>
         <description>Audio SPI with 8 channels compatibilty</description>
         <baseAddress>0x45016000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SPI_IXS</name>
            <description>Audio SPI Interrupt</description>
            <value>140</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>SPI Control Enable Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>SPI Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>SPI Enable (ON) bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>RUN STANDBY Mode Enable bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SELCTRL</name>
               <description>SPI Control Options Select Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLKINDLY</name>
                     <description>Serial Clock Input Delay for SDI sampling</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CLKINDLYSelect</name>
                        <enumeratedValue>
                           <name>TDLY0</name>
                           <description>0 Tap Delays</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDLY1</name>
                           <description>1 Tap Delay</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDLY2</name>
                           <description>2 Tap Delay</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDLY3</name>
                           <description>3 Tap Delay</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRXISEL</name>
                     <description>SPI Receive Service Request Interrupt Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRXISELSelect</name>
                        <enumeratedValue>
                           <name>RXBEMPTY</name>
                           <description>RXB Empty</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXBNEMPTY</name>
                           <description>RXB Not Empty</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXBHFULL</name>
                           <description>RXB Half Full</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXBFULL</name>
                           <description>RXB Full</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IGNROV</name>
                     <description>Ignore Receive Overflow (for Audio Data Transmissions)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>SPI Clock Edge Select bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>Clock Polarity Select bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STXISEL</name>
                     <description>SPI Transmit Service Request Interrupt Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>STXISELSelect</name>
                        <enumeratedValue>
                           <name>TXBSREMPTY</name>
                           <description>TXB And SR Empty</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXBEMPTY</name>
                           <description>TXB Empty</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXBHEMPTY</name>
                           <description>TXB Half Empty</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXBNFULL</name>
                           <description>TXB Not Full</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IGNTUR</name>
                     <description>Ignore Transmit Underrun (for Audio Data Transmissions)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATFMTLR</name>
                     <description>Packed data format -- left or right justified</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TURSAMP</name>
                     <description>Transmit Under-run last sample sent</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATFILL</name>
                     <description>DATFILL undefined bits 1 or 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODEEN</name>
                     <description>MACRO MODE ENABLED</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MODEENSelect</name>
                        <enumeratedValue>
                           <name>DFTLEN</name>
                           <description>Default Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUDEN</name>
                           <description>Audio Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDMEN</name>
                           <description>Framed Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPDEN</name>
                           <description>Broadcast Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPICTRL</name>
               <description>SPI Control Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Serial Word Length bits for AUDEN=0, not used when AUDEN=1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>MODE8</name>
                           <description>8 Bits Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE16</name>
                           <description>16 Bits Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE32</name>
                           <description>32 Bits Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DISSDI</name>
                     <description>Disable SDI bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISSDO</name>
                     <description>Disable SDO bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTEN</name>
                     <description>Master Mode Enable bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSSEN</name>
                     <description>Master/Slave Mode Select Enable bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPISGNEXT</name>
                     <description>Sign Extend Read Data from the RX FIFO</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMP</name>
                     <description>SPI Data Input Sample Phase bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
